Revit 2024 API
BuiltInFailures.SketchFailures.SculptingCurvesCannotFormClosedLoop Property
 Curves cannot form a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SculptingCurvesCannotFormClosedLoop { get; }
Visual Basic
Public Shared ReadOnly Property SculptingCurvesCannotFormClosedLoop As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SculptingCurvesCannotFormClosedLoop {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace